src/bsl/InformationRegisters/гкс_НастройкиПечатиФормированияПроб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НастройкиПечатиФормированияПроб</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЭтикеток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПробы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Comment>ERP-1220</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_НазначенияИспользованияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_НазначенияИспользованияКачества</Name>
			<Comment>ERP-2184</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаКомпозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлеваторВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛаборантВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпозитВнешниеПробыНаТысячуТон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточныйКомпозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйАнализ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыПроб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыПроб</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Композитная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_НастройкиПечатиФормированияПроб/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает количество образцов проб по параметрам
// Номенклатура - СправочникСсылка.Номенклатура
// ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута
// ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки
// ВидПробы - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества, ПеречислениеСсылка.гкс_ТипыПроб
// Возвращаемое значение:
// - Количество
Функция КоличествоОбразцовПробПоПараметрамОтбора(Номенклатура, ТочкаМаршрута, ВидПеревозки, ВидАнализа) Экспорт
	
	КоличествоПроб = 0;
	
	Запрос = Новый Запрос;             
	Если ТипЗнч(ВидАнализа) = Тип("ПеречислениеСсылка.гкс_ТипыПроб") Тогда
		ТипПробы = ВидАнализа;                       
	Иначе
		ТипПробы = ТипПробыПоНазначениюИспользованияАнализа(ВидАнализа);
	КонецЕсли;	
		
	Запрос.Текст = ТекстЗапросаНастройкиФормирвоанияПроб();
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("ТипПробы", ТипПробы);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		КоличествоПроб = Выборка.КоличествоЭтикеток; 
	КонецЕсли;	
	
	Возврат КоличествоПроб;
	
КонецФункции	

#КонецОбласти                                              

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаНастройкиФормирвоанияПроб()
	Возврат
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НастройкиПечатиФормированияПроб.КоличествоЭтикеток КАК КоличествоЭтикеток,
		|	НастройкиПечатиФормированияПроб.ОбъемПробы КАК ОбъемПробы,
		|	НастройкиПечатиФормированияПроб.ГОСТ КАК ГОСТ
		|ИЗ
		|	РегистрСведений.гкс_НастройкиПечатиФормированияПроб КАК НастройкиПечатиФормированияПроб
		|ГДЕ
		|	НастройкиПечатиФормированияПроб.ТочкаМаршрута = &ТочкаМаршрута
		|	И НастройкиПечатиФормированияПроб.Номенклатура = &Номенклатура
		|	И НастройкиПечатиФормированияПроб.ВидПеревозки = &ВидПеревозки
		|	И НастройкиПечатиФормированияПроб.ТипПробы = &ТипПробы";
	
КонецФункции  

Функция ТипПробыПоНазначениюИспользованияАнализа(ВидАнализа)
	
	Если ВидАнализа = Перечисления.гкс_НазначенияИспользованияКачества.Приемка Тогда
		ТипПробы = Перечисления.гкс_ТипыПроб.Единичная;
	Иначе
		ТипПробы = Перечисления.гкс_ТипыПроб.Композитная;
	КонецЕсли;
	
	Возврат ТипПробы;
	
КонецФункции	
#КонецОбласти                                              

#КонецЕсли
